In [1]:
import mysql.connector as sql
import pandas as pd
db_connection = sql.connect(host='localhost',database='juanda',user='root',password='123456')

In [2]:
df = pd.read_sql('select * from students',db_connection)
df.head()

     Name             Email DateofBirth    Salary      address  student_id
0    Paul    paul@bootup.ai  1990-05-15  123456.0      Jakarta           1
1  Juanda  juanda@bootup.ai  1998-09-25  123456.0      Jakarta           2
2    Mark    john@bootup.ai  1995-01-01  133456.0  Los Angeles           4
3     Meg     meg@bootup.ai  1993-12-10   13566.0     New York          11
4    Ryan    ryan@bootup.ai  1998-08-17   26566.0       London          12

In [3]:
df = pd.read_csv('Bank_churn_modelling.csv')

In [4]:
import sqlalchemy

In [7]:
conn = sqlalchemy.create_engine('mysql+mysqlconnector://root:123456@localhost/juanda')

In [8]:
df.to_sql(con=conn,name='bank_churn',if_exists='replace',index=False)